# GetObjectUuid

## Description
Function GetObjectUuid returns the UUID of the referenced object.

```pascal
FUNCTION GetObjectUuid(h : HANDLE) : STRING;
```

```python

def vs.GetObjectUuid(h):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object|

## Returns
STRING

## See Also
VS Functions:
GetObjectByUuid

## Version
Availability: from Vectorworks 2018.4
## Category
* Object Info